# 1

In [1]:
import pandas as pd


df = pd.read_csv("../data/gapminder.tsv", sep="\t")

df.head(10)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106
5  Afghanistan      Asia  1977   38.438  14880372  786.113360
6  Afghanistan      Asia  1982   39.854  12881816  978.011439
7  Afghanistan      Asia  1987   40.822  13867957  852.395945
8  Afghanistan      Asia  1992   41.674  16317921  649.341395
9  Afghanistan      Asia  1997   41.763  22227415  635.341351

# 2

In [10]:
print("Colonnes:", list(df.columns))

print("Indexes:", df.index)

print("Valeurs:")
print(df.values)

Colonnes: ['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap']
Indexes: RangeIndex(start=0, stop=1704, step=1)
Valeurs:
[['Afghanistan' 'Asia' 1952 28.801 8425333 779.4453145]
 ['Afghanistan' 'Asia' 1957 30.332 9240934 820.8530296]
 ['Afghanistan' 'Asia' 1962 31.997 10267083 853.10071]
 ...
 ['Zimbabwe' 'Africa' 1997 46.809 11404948 792.4499603]
 ['Zimbabwe' 'Africa' 2002 39.989 11926563 672.0386227]
 ['Zimbabwe' 'Africa' 2007 43.487 12311143 469.7092981]]

# 3

In [11]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

# 4

In [12]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

# 5

In [50]:
display(df["country"])
print(type(df["country"].iloc[0]))

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

<class 'str'>

# 6

In [18]:
df.tail(1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

# 7

In [23]:
df.iloc[[0, 222, 212]]

         country continent  year  lifeExp      pop   gdpPercap
0    Afghanistan      Asia  1952   28.801  8425333  779.445314
222     Cambodia      Asia  1982   50.957  7272485  624.475478
212      Burundi    Africa  1992   44.736  5809236  631.699878

# 8

In [25]:
df.iloc[[-1]]

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

# 9

In [36]:
df.loc[:][["country", "continent"]]

          country continent
0     Afghanistan      Asia
1     Afghanistan      Asia
2     Afghanistan      Asia
3     Afghanistan      Asia
4     Afghanistan      Asia
...           ...       ...
1699     Zimbabwe    Africa
1700     Zimbabwe    Africa
1701     Zimbabwe    Africa
1702     Zimbabwe    Africa
1703     Zimbabwe    Africa

[1704 rows x 2 columns]

# 10

In [37]:
df.iloc[:][["country", "continent"]]

          country continent
0     Afghanistan      Asia
1     Afghanistan      Asia
2     Afghanistan      Asia
3     Afghanistan      Asia
4     Afghanistan      Asia
...           ...       ...
1699     Zimbabwe    Africa
1700     Zimbabwe    Africa
1701     Zimbabwe    Africa
1702     Zimbabwe    Africa
1703     Zimbabwe    Africa

[1704 rows x 2 columns]

# 11

In [38]:
df.iloc[range(3)]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

# 12

In [42]:
grouped_year = df.groupby("year")
print(grouped_year)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7ff92e31f620>

Ce code génère un objet de type `DataFrameGroupBy` qui utilise la colonne `year` comme critère de regroupement.

# 13

In [43]:
grouped_year.mean(True)

        lifeExp           pop     gdpPercap
year
1952  49.057620  1.695040e+07   3725.276046
1957  51.507401  1.876341e+07   4299.408345
1962  53.609249  2.042101e+07   4725.812342
1967  55.678290  2.265830e+07   5483.653047
1972  57.647386  2.518998e+07   6770.082815
1977  59.570157  2.767638e+07   7313.166421
1982  61.533197  3.020730e+07   7518.901673
1987  63.212613  3.303857e+07   7900.920218
1992  64.160338  3.599092e+07   8158.608521
1997  65.014676  3.883947e+07   9090.175363
2002  65.694923  4.145759e+07   9917.848365
2007  67.007423  4.402122e+07  11680.071820

Il est nécessaire de mettre `numeric_only` à `True` car la fonction `mean` ne fonctionne que sur les valeurs numériques.

# 14

In [44]:
grouped_year.mean(True)[["lifeExp"]]

        lifeExp
year
1952  49.057620
1957  51.507401
1962  53.609249
1967  55.678290
1972  57.647386
1977  59.570157
1982  61.533197
1987  63.212613
1992  64.160338
1997  65.014676
2002  65.694923
2007  67.007423

# 15

In [48]:
life_gdp = df.groupby(["year", "continent"]).mean(True)[["lifeExp", "gdpPercap"]]

# 16

In [51]:
continent_col = df["continent"]

print(f"Première valeur dans la colonne : {continent_col.loc[0]}")

print(f"Type des valeurs dans la colonne : {continent_col.dtype}")

print(f"Nombre de valeurs dans la colonne : {continent_col.size}")

print(f"Dimension d'une colonne : {continent_col.shape}")

Première valeur dans la colonne : Asia
Type des valeurs dans la colonne : object
Nombre de valeurs dans la colonne : 1704
Dimension d'une colonne : (1704,)

Ce code récupère les attributes `dtype`, `size`, et `shape` de la colonne `continent`.

# 17

In [52]:
life_exp_col = df["lifeExp"]

print(f"Espérance de vie maximale : {life_exp_col.max()}")
print(f"Espérance de vie minimale : {life_exp_col.min()}")
print(f"Espérance de vie moyenne : {life_exp_col.mean()}")
print(f"Écart-type de l'spérance de vie : {life_exp_col.std()}")
print(f"Médiane de l'spérance de vie : {life_exp_col.median()}")

Espérance de vie maximale : 82.603
Espérance de vie minimale : 23.599
Espérance de vie moyenne : 59.474439366197174
Écart-type de l'spérance de vie : 12.917107415241192
Médiane de l'spérance de vie : 60.7125

Ce code récupère des données statistiques sur les valeurs de la colonne `lifeExp` grâce aux fonctions fournies par la bibliothèque.

# 18

In [54]:
df["lifeExp"].describe()

count    1704.000000
mean       59.474439
std        12.917107
min        23.599000
25%        48.198000
50%        60.712500
75%        70.845500
max        82.603000
Name: lifeExp, dtype: float64

# 19

In [55]:
life_exp_col < life_exp_col.mean()

0        True
1        True
2        True
3        True
4        True
        ...
1699    False
1700    False
1701     True
1702     True
1703     True
Name: lifeExp, Length: 1704, dtype: bool

Ce code renvoie une série booléenne indiquant pour chaque valeur si elle est inférieure à la moyenne.

In [56]:
print(life_exp_col[life_exp_col < life_exp_col.mean()])

0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1696    55.635
1697    57.674
1701    46.809
1702    39.989
1703    43.487
Name: lifeExp, Length: 809, dtype: float64

Ce code renvoie la série avec seulement les valeurs satisfaisant la condition précédente.

In [57]:
print(life_exp_col + life_exp_col)

0        57.602
1        60.664
2        63.994
3        68.040
4        72.176
         ...
1699    124.702
1700    120.754
1701     93.618
1702     79.978
1703     86.974
Name: lifeExp, Length: 1704, dtype: float64

Ce code renvoie une série dont les valeurs sont la somme précédente de la série avec elle même, donc multipliée par deux.

In [58]:
print(life_exp_col + 10)

0       38.801
1       40.332
2       41.997
3       44.020
4       46.088
         ...
1699    72.351
1700    70.377
1701    56.809
1702    49.989
1703    53.487
Name: lifeExp, Length: 1704, dtype: float64

Ce code renvoie la série avec 10 ajouté à toutes les valeurs.

# 20

In [61]:
minimum = life_exp_col.min()
maximum = life_exp_col.max()

((life_exp_col - minimum) / (maximum - minimum))

0       0.088164
1       0.114111
2       0.142329
3       0.176615
4       0.211664
          ...
1699    0.656769
1700    0.623314
1701    0.393363
1702    0.277778
1703    0.337062
Name: lifeExp, Length: 1704, dtype: float64

# 21

In [66]:
avg_life_exp = life_exp_col.mean()

pd.DataFrame.from_dict({"country": df[df["lifeExp"] < avg_life_exp]["country"].unique()})

                country
0           Afghanistan
1               Albania
2               Algeria
3                Angola
4               Bahrain
..                  ...
100             Vietnam
101  West Bank and Gaza
102         Yemen, Rep.
103              Zambia
104            Zimbabwe

[105 rows x 1 columns]